W6D3/first_route_project/app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
  def index
    # render plain: "I'm in the index action!"
    render json: User.all

INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Lena"], ["email", "lena@gmail.com"], ["created_at", "2020-12-29 23:09:49.863923"], ["updated_at", "2020-12-29 23:09:49.863923"]]
---
  def create
    # render json: params

    user = User.new(user_params)
    # replace the `user_attributes_here` with the actual attribute keys
    # user.save!
    # render json: user
    debugger
    if user.save